# Machine Learning Project 1 - House Price Prediction

In [ ]:
import pandas as pd

In [405]:
df1 = pd.read_csv('bengaluru_house_prices.csv')

In [406]:
df1.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.000,1.000,39.070
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.000,3.000,120.000
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.000,3.000,62.000
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.000,1.000,95.000
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.000,1.000,51.000

In [337]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [338]:
df1.shape

(13320, 9)

In [339]:
df2 = df1.drop(['area_type','society','balcony'],axis=1)

In [340]:
df2.head()

    availability                  location       size total_sqft  bath   price
0         19-Dec  Electronic City Phase II      2 BHK       1056 2.000  39.070
1  Ready To Move          Chikka Tirupathi  4 Bedroom       2600 5.000 120.000
2  Ready To Move               Uttarahalli      3 BHK       1440 2.000  62.000
3  Ready To Move        Lingadheeranahalli      3 BHK       1521 3.000  95.000
4  Ready To Move                  Kothanur      2 BHK       1200 2.000  51.000

In [341]:
df2.isnull().sum()

availability     0
location         1
size            16
total_sqft       0
bath            73
price            0
dtype: int64

In [401]:
df3 = df2.dropna()

In [402]:
df3.isnull().sum()

availability    0
location        0
size            0
total_sqft      0
bath            0
price           0
dtype: int64

In [403]:
df3.head()

    availability                  location       size total_sqft  bath   price
0         19-Dec  Electronic City Phase II      2 BHK       1056 2.000  39.070
1  Ready To Move          Chikka Tirupathi  4 Bedroom       2600 5.000 120.000
2  Ready To Move               Uttarahalli      3 BHK       1440 2.000  62.000
3  Ready To Move        Lingadheeranahalli      3 BHK       1521 3.000  95.000
4  Ready To Move                  Kothanur      2 BHK       1200 2.000  51.000

In [404]:
df3['availability'].unique()

array(['19-Dec', 'Ready To Move', '18-May', '18-Feb', '18-Nov', '20-Dec',
       '17-Oct', '21-Dec', '19-Sep', '20-Sep', '18-Mar', '18-Apr',
       '20-Aug', '19-Mar', '17-Sep', '18-Dec', '17-Aug', '19-Apr',
       '18-Jun', '22-Dec', '22-Jan', '18-Aug', '19-Jan', '17-Jul',
       '18-Jul', '21-Jun', '20-May', '19-Aug', '18-Sep', '17-May',
       '17-Jun', '18-Oct', '21-May', '18-Jan', '20-Mar', '17-Dec',
       '16-Mar', '19-Jun', '22-Jun', '19-Jul', '21-Feb', '19-May',
       '17-Nov', '20-Oct', '20-Jun', '19-Feb', '21-Oct', '21-Jan',
       '17-Mar', '17-Apr', '22-May', '19-Oct', '21-Jul', '21-Nov',
       '21-Mar', '16-Dec', '22-Mar', '20-Jan', '21-Sep', '21-Aug',
       '14-Nov', '19-Nov', '15-Nov', '16-Jul', '15-Jun', '17-Feb',
       '20-Nov', '20-Jul', '16-Sep', '15-Oct', '20-Feb', '15-Dec',
       '16-Oct', '22-Nov', '15-Aug', '17-Jan', '16-Nov', '20-Apr',
       '16-Jan', '14-Jul'], dtype=object)

In [346]:
df3.groupby("availability")["availability"].count()

availability
14-Jul               1
14-Nov               1
15-Aug               1
15-Dec               1
15-Jun               1
                 ...
22-Jun              19
22-Mar               3
22-May               8
22-Nov               2
Ready To Move    10564
Name: availability, Length: 80, dtype: int64

In [410]:
df3['availability']=df3['availability'].apply(lambda x: x if x in ('Ready To Move') else 'Future Possession')

E:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [411]:
df3.groupby("availability")["availability"].count()

availability
Future Possession     2682
Ready To Move        10564
Name: availability, dtype: int64

In [412]:
df3['location'].unique()

array(['Electronic City Phase II', 'Chikka Tirupathi', 'Uttarahalli', ...,
       '12th cross srinivas nagar banshankari 3rd stage',
       'Havanur extension', 'Abshot Layout'], dtype=object)

In [413]:
df3.groupby("location")["location"].count().sort_values(ascending = False)

location
Whitefield                            534
Sarjapur  Road                        392
Electronic City                       302
Kanakpura Road                        266
Thanisandra                           233
                                     ...
Konappana Agrahara                      1
Kodanda Reddy Layout                    1
Kirloskar layout, Basaveshwarnagar      1
Kengeri Satellite Town Stage II         1
 Anekal                                 1
Name: location, Length: 1304, dtype: int64

In [414]:
locations = df3.groupby('location')['location'].count().sort_values()

In [415]:
locations

location
 Anekal                                 1
Kengeri Satellite Town Stage II         1
Kirloskar layout, Basaveshwarnagar      1
Kodanda Reddy Layout                    1
Konappana Agrahara                      1
                                     ...
Thanisandra                           233
Kanakpura Road                        266
Electronic City                       302
Sarjapur  Road                        392
Whitefield                            534
Name: location, Length: 1304, dtype: int64

In [416]:
locations_20cnt = locations[locations <= 20]

In [417]:
locations_20cnt

location
 Anekal                                1
Kengeri Satellite Town Stage II        1
Kirloskar layout, Basaveshwarnagar     1
Kodanda Reddy Layout                   1
Konappana Agrahara                     1
                                      ..
HBR Layout                            20
Sanjay nagar                          20
Yelachenahalli                        20
Binny Pete                            20
Poorna Pragna Layout                  20
Name: location, Length: 1161, dtype: int64

In [418]:
df3['location'] = df3['location'].apply(lambda x: 'Others' if x in locations_20cnt else x)

E:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [419]:
df3.groupby("location")["location"].count().sort_values(ascending = False)

location
Others                4314
Whitefield             534
Sarjapur  Road         392
Electronic City        302
Kanakpura Road         266
                      ...
Kathriguppe             22
Rayasandra              22
Ulsoor                  21
Basaveshwara Nagar      21
Hoskote                 21
Name: location, Length: 144, dtype: int64

In [420]:
df3.head()

,availability,location,size,total_sqft,bath,price
0,Future Possession,Electronic City Phase II,2 BHK,1056,2.000,39.070
1,Ready To Move,Others,4 Bedroom,2600,5.000,120.000
2,Ready To Move,Uttarahalli,3 BHK,1440,2.000,62.000
3,Ready To Move,Lingadheeranahalli,3 BHK,1521,3.000,95.000
4,Ready To Move,Kothanur,2 BHK,1200,2.000,51.000

In [358]:
df3['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [421]:
import re 
df3['bhks'] =df3['size'].apply(lambda x:  int(re.findall('\d+',x)[0].strip()))

E:\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [422]:
df3.head()

,availability,location,size,total_sqft,bath,price,bhks
0,Future Possession,Electronic City Phase II,2 BHK,1056,2.000,39.070,2
1,Ready To Move,Others,4 Bedroom,2600,5.000,120.000,4
2,Ready To Move,Uttarahalli,3 BHK,1440,2.000,62.000,3
3,Ready To Move,Lingadheeranahalli,3 BHK,1521,3.000,95.000,3
4,Ready To Move,Kothanur,2 BHK,1200,2.000,51.000,2

In [423]:
df3['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [424]:
 def get_mean(x):
    if re.findall('-',x):
        ss = x.strip().split('-')
        return ((float(ss[0])+float(ss[0]))/2)
    try:
        return float(x.strip())
    except:
        return None

In [425]:
df3['total_sqft_new']=df3['total_sqft'].apply(get_mean)

E:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [426]:
df3.head()

,availability,location,size,total_sqft,bath,price,bhks,total_sqft_new
0,Future Possession,Electronic City Phase II,2 BHK,1056,2.000,39.070,2,1056.000
1,Ready To Move,Others,4 Bedroom,2600,5.000,120.000,4,2600.000
2,Ready To Move,Uttarahalli,3 BHK,1440,2.000,62.000,3,1440.000
3,Ready To Move,Lingadheeranahalli,3 BHK,1521,3.000,95.000,3,1521.000
4,Ready To Move,Kothanur,2 BHK,1200,2.000,51.000,2,1200.000

In [430]:
df3.isnull().sum()

availability       0
location           0
size               0
total_sqft         0
bath               0
price              0
bhks               0
total_sqft_new    46
dtype: int64

In [431]:
df4 = df3.dropna()

In [432]:
df4.isnull().sum()

availability      0
location          0
size              0
total_sqft        0
bath              0
price             0
bhks              0
total_sqft_new    0
dtype: int64

In [433]:
df4['bath'].unique()

array([ 2.,  5.,  3.,  4.,  6.,  1.,  9.,  8.,  7., 11., 10., 14., 27.,
       12., 16., 40., 15., 13., 18.])

In [434]:
df4.groupby('bath')['bath'].count().sort_values()

bath
40.000       1
18.000       1
15.000       1
14.000       1
27.000       1
16.000       2
13.000       3
11.000       3
12.000       7
10.000      13
9.000       41
8.000       64
7.000      102
6.000      269
5.000      521
1.000      781
4.000     1222
3.000     3274
2.000     6893
Name: bath, dtype: int64

In [435]:
df5 = df4[df4['bath'] <= 10]

In [436]:
df5.head()

,availability,location,size,total_sqft,bath,price,bhks,total_sqft_new
0,Future Possession,Electronic City Phase II,2 BHK,1056,2.000,39.070,2,1056.000
1,Ready To Move,Others,4 Bedroom,2600,5.000,120.000,4,2600.000
2,Ready To Move,Uttarahalli,3 BHK,1440,2.000,62.000,3,1440.000
3,Ready To Move,Lingadheeranahalli,3 BHK,1521,3.000,95.000,3,1521.000
4,Ready To Move,Kothanur,2 BHK,1200,2.000,51.000,2,1200.000

In [437]:
df6  = df5.drop(['size','total_sqft'],axis=1)

In [438]:
df6.head()

,availability,location,bath,price,bhks,total_sqft_new
0,Future Possession,Electronic City Phase II,2.000,39.070,2,1056.000
1,Ready To Move,Others,5.000,120.000,4,2600.000
2,Ready To Move,Uttarahalli,2.000,62.000,3,1440.000
3,Ready To Move,Lingadheeranahalli,3.000,95.000,3,1521.000
4,Ready To Move,Kothanur,2.000,51.000,2,1200.000

In [439]:
df6[df6['total_sqft_new']/df6['bhks'] < 400]

        availability          location  bath   price  bhks  total_sqft_new
9      Ready To Move            Others 6.000 370.000     6        1020.000
16     Ready To Move     Bisuvanahalli 3.000  48.000     3        1180.000
26     Ready To Move   Electronic City 1.000  23.100     2         660.000
29     Ready To Move   Electronic City 2.000  47.000     3        1025.000
31     Ready To Move     Bisuvanahalli 2.000  35.000     3        1075.000
...              ...               ...   ...     ...   ...             ...
13281  Ready To Move   Margondanahalli 5.000 125.000     5        1375.000
13300  Ready To Move     Hosakerehalli 6.000 145.000     5        1500.000
13303  Ready To Move    Vidyaranyapura 5.000  70.000     5         774.000
13306  Ready To Move            Others 5.000 325.000     4        1200.000
13311  Ready To Move  Ramamurthy Nagar 9.000 250.000     7        1500.000

[1480 rows x 6 columns]

In [440]:
df7 = df6[df6['total_sqft_new']/df6['bhks'] > 400]

In [441]:
df7.head()

,availability,location,bath,price,bhks,total_sqft_new
0,Future Possession,Electronic City Phase II,2.000,39.070,2,1056.000
1,Ready To Move,Others,5.000,120.000,4,2600.000
2,Ready To Move,Uttarahalli,2.000,62.000,3,1440.000
3,Ready To Move,Lingadheeranahalli,3.000,95.000,3,1521.000
4,Ready To Move,Kothanur,2.000,51.000,2,1200.000

In [442]:
df7['price_per_sqft']=df7['price']*100000/df7['total_sqft_new']

E:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [443]:
df7

,availability,location,bath,price,bhks,total_sqft_new,price_per_sqft
0,Future Possession,Electronic City Phase II,2.000,39.070,2,1056.000,3699.811
1,Ready To Move,Others,5.000,120.000,4,2600.000,4615.385
2,Ready To Move,Uttarahalli,2.000,62.000,3,1440.000,4305.556
3,Ready To Move,Lingadheeranahalli,3.000,95.000,3,1521.000,6245.891
4,Ready To Move,Kothanur,2.000,51.000,2,1200.000,4250.000
...,...,...,...,...,...,...,...
13315,Ready To Move,Whitefield,4.000,231.000,5,3453.000,6689.835
13316,Ready To Move,Others,5.000,400.000,4,3600.000,11111.111
13317,Ready To Move,Raja Rajeshwari Nagar,2.000,60.000,2,1141.000,5258.545
13318,Future Possession,Padmanabhanagar,4.000,488.000,4,4689.000,10407.336
13319,Ready To Move,Doddathoguru,1.000,17.000,1,550.000,3090.909

In [444]:
df7['price_per_sqft'].describe()

count    11446.000
mean      6131.272
std       3932.983
min        267.830
25%       4202.939
50%       5263.158
75%       6768.856
max     176470.588
Name: price_per_sqft, dtype: float64

In [445]:
def rmv_price_outlier(df):
    df_new=pd.DataFrame()
    for key,sdf in df.groupby('location'):
        m = sdf['price_per_sqft'].mean()
        s = sdf['price_per_sqft'].std()
        #print (sdf['location'])
        rdf = sdf[(sdf['price_per_sqft'] <= m+s) & (sdf['price_per_sqft'] > m-s)]
        #print(rdf)
        df_new = pd.concat([df_new,rdf],ignore_index=True)
    return df_new

In [446]:
df8 = rmv_price_outlier(df7)

In [447]:
df8.head()

,availability,location,bath,price,bhks,total_sqft_new,price_per_sqft
0,Ready To Move,1st Phase JP Nagar,4.000,250.000,4,2825.000,8849.558
1,Ready To Move,1st Phase JP Nagar,3.000,167.000,3,1875.000,8906.667
2,Ready To Move,1st Phase JP Nagar,4.000,210.000,3,2065.000,10169.492
3,Ready To Move,1st Phase JP Nagar,3.000,157.000,3,2024.000,7756.917
4,Ready To Move,1st Phase JP Nagar,3.000,225.000,3,2059.000,10927.635

In [448]:
df8.shape

(9512, 7)

In [449]:
availability_dummy = pd.get_dummies(df8['availability'],drop_first=True)

In [450]:
availability_dummy

      Ready To Move
0                 1
1                 1
2                 1
3                 1
4                 1
...             ...
9507              1
9508              1
9509              1
9510              1
9511              1

[9512 rows x 1 columns]

In [451]:
location_dummy = pd.get_dummies(df8['location'],drop_first=True)

In [452]:
df9=pd.concat([df8, availability_dummy,location_dummy],axis=1)

In [453]:
df9.head()

,availability,location,bath,price,bhks,total_sqft_new,price_per_sqft,Ready To Move,2nd Stage Nagarbhavi,5th Phase JP Nagar,...,Ulsoor,Uttarahalli,Varthur,Vidyaranyapura,Vijayanagar,Vittasandra,Whitefield,Yelahanka,Yelahanka New Town,Yeshwanthpur
0,Ready To Move,1st Phase JP Nagar,4.000,250.000,4,2825.000,8849.558,1,0,0,...,0,0,0,0,0,0,0,0,0,0
1,Ready To Move,1st Phase JP Nagar,3.000,167.000,3,1875.000,8906.667,1,0,0,...,0,0,0,0,0,0,0,0,0,0
2,Ready To Move,1st Phase JP Nagar,4.000,210.000,3,2065.000,10169.492,1,0,0,...,0,0,0,0,0,0,0,0,0,0
3,Ready To Move,1st Phase JP Nagar,3.000,157.000,3,2024.000,7756.917,1,0,0,...,0,0,0,0,0,0,0,0,0,0
4,Ready To Move,1st Phase JP Nagar,3.000,225.000,3,2059.000,10927.635,1,0,0,...,0,0,0,0,0,0,0,0,0,0

In [454]:
df10=df9.drop(['availability','location','price_per_sqft'],axis=1)

In [455]:
df10.head()

,bath,price,bhks,total_sqft_new,Ready To Move,2nd Stage Nagarbhavi,5th Phase JP Nagar,6th Phase JP Nagar,7th Phase JP Nagar,8th Phase JP Nagar,...,Ulsoor,Uttarahalli,Varthur,Vidyaranyapura,Vijayanagar,Vittasandra,Whitefield,Yelahanka,Yelahanka New Town,Yeshwanthpur
0,4.000,250.000,4,2825.000,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,3.000,167.000,3,1875.000,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,4.000,210.000,3,2065.000,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,3.000,157.000,3,2024.000,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,3.000,225.000,3,2059.000,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [456]:
X = df10.drop(['price'], axis=1)
y = df10['price']

In [457]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.2, random_state=0)

In [458]:
len(X_train)

7609

In [459]:
len(X_test)

1903

In [460]:
X_train.describe()

,bath,bhks,total_sqft_new,Ready To Move,2nd Stage Nagarbhavi,5th Phase JP Nagar,6th Phase JP Nagar,7th Phase JP Nagar,8th Phase JP Nagar,9th Phase JP Nagar,...,Ulsoor,Uttarahalli,Varthur,Vidyaranyapura,Vijayanagar,Vittasandra,Whitefield,Yelahanka,Yelahanka New Town,Yeshwanthpur
count,7609.000,7609.000,7609.000,7609.000,7609.000,7609.000,7609.000,7609.000,7609.000,7609.000,...,7609.000,7609.000,7609.000,7609.000,7609.000,7609.000,7609.000,7609.000,7609.000,7609.000
mean,2.451,2.523,1518.513,0.782,0.000,0.002,0.002,0.010,0.004,0.003,...,0.001,0.014,0.005,0.002,0.002,0.003,0.048,0.017,0.004,0.007
std,0.918,0.825,898.791,0.413,0.011,0.047,0.040,0.100,0.059,0.052,...,0.030,0.118,0.071,0.044,0.050,0.056,0.213,0.131,0.059,0.082
min,1.000,1.000,410.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,...,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000
25%,2.000,2.000,1120.000,1.000,0.000,0.000,0.000,0.000,0.000,0.000,...,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000
50%,2.000,2.000,1300.000,1.000,0.000,0.000,0.000,0.000,0.000,0.000,...,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000
75%,3.000,3.000,1650.000,1.000,0.000,0.000,0.000,0.000,0.000,0.000,...,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000,0.000
max,9.000,11.000,30400.000,1.000,1.000,1.000,1.000,1.000,1.000,1.000,...,1.000,1.000,1.000,1.000,1.000,1.000,1.000,1.000,1.000,1.000

In [461]:
from sklearn.linear_model import LinearRegression
from sklearn.tree import DecisionTreeRegressor
from sklearn.model_selection import cross_val_score

In [465]:
model_score =cross_val_score(estimator=LinearRegression(),X=X_train, y=y_train, cv=6)
model_score

array([0.88749248, 0.83974159, 0.77816298, 0.78621149, 0.80342302,
       0.75351985])

In [467]:
model_score.mean()

0.8080919019704589

In [469]:
model_score.std()

0.04412209423154256

In [471]:
model_score =cross_val_score(estimator=DecisionTreeRegressor(),X=X_train, y=y_train, cv=5)
model_score

array([0.85158695, 0.68749202, 0.54764214, 0.7192667 , 0.45725236])

In [473]:
model_score.mean()

0.6526480329027052

In [475]:
model_score.std()

0.13742965399712503

In [476]:
model_lr = LinearRegression()
model_lr.fit(X_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)